package main

var (
	subjectsTimeTree = []string{
		"国語2",
		"歴史2",
		"基礎数学4",
		"微分積分1",
		"代数・幾何1",
		"物理2",
		"化学",
		"保健体育2",
		"EC",
		"EC",
		"EE2",
		"一般基礎教育2",
		"情報工学1",
		"情報工学2",
		"電気電子",
		"機械加工基礎",
		"PBL2",
	}

	subjectsOmitted = []string{
		"国語",
		"歴史",
		"基礎数",
		"微積分",
		"代数幾何",
		"物理",
		"理科",
		"保体",
		"EC",
		"EC",
		"EE",
		"一般基礎",
		"情報",
		"情報",
		"電電",
		"機械",
		"PBL",
	}

	subjectsOneChar = []string{
		"国",
		"歴",
		"数",
		"微",
		"幾",
		"物",
		"理",
		"保",
		"英",
		"英",
		"英",
		"基",
		"情",
		"情",
		"電",
		"機",
		"P",
	}
)
